'use strict'
/*задача 1
Создать массив из 10 чисел.
Необходимо создать новый массив, в котором числа будут возведены в квадрат.
Например: [1,2,3] -> [1,4,9].*/

function getSquareNumber(arr){
    return arr.map((item) => {
        return item * item;
    })
}
getSquareNumber([1,2,3,4,5,6,7,8,9,10])
==============================================================================
/*задача 2
Создать массив из 20 чисел. Необходимо высчитать сумму всех элементов.*/

function getSumNumber(arr){
    return arr.reduce((sum, item) => {
        return sum + item;
    })
}
getSumNumber([1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20])
==============================================================================
/*задача 3
Напишите код, который добавит символ двоеточие(':') между нечетными числами.
Например, число 556 результат должен быть '5:56', 566 -> 566, 655 -> 65:5*/

==============================================================================
/*задача 4
Создайте 2 массива с разной длинной. Необходимо написать код,который создаёт
массив элементов представляющих собой разность соответствующих элементов заданных массивов.*/
let arrX = [5,6,7,8,9,10];
let arrY = [1,2,3,4,5,6,7,8,9]
let arrResult = []
let length = arrX.length < arrY.length ? arrX.length : arrY.length
for(let i=0; i<length; i++){
    arrResult.push(arrX[i]-arrY[i])
}
==============================================================================
/*задача 5
Создайте 2 массива с разной длинной. Необходимо написать код,который создаёт
массив элементов представляющих собой сумму соответствующих элементов заданных массивов.*/
let arrX = [5,6,7,8,9,10];
let arrY = [1,2,3,4,5,6,7,8,9]
let arrResult = []
let length = arrX.length < arrY.length ? arrX.length : arrY.length
for(let i=0; i<length; i++){
    arrResult.push(arrX[i]+arrY[i])
}
==============================================================================
/*задача 6
Напишите код, который разворачивает исходный массив и сохраняет это в новую
переменную.
Например: исходный массив - [1, 2, 3], результирующий массив - [3, 2, 1]*/

let arr = [1,2,3,4,5,6,7,8,9]
function reverseArr(arr){
    return arr.reverse()
}
let updateArr = reverseArr(arr)
==============================================================================
/*задача 7
Фильтр юзеров Создать массив объектов для юзеров. Пример:

[{name: ‘Ivan’, age: 18}, {name: ‘Petr’, age: 12}, {name: ‘Sidor’, age: 25}, {...}, ...]
Написать скрипт, который будет на выходе отдавать два массива.
Первый с совершеннолетними пользователями, второй с несовершеннолетними.*/

let users = [{name: 'Ivan', age: 18},{name: 'Petr', age: 12},{name: 'Sidor', age: 25},{name: 'Zheka', age: 29}]
let adultUsers =[];
let noAdultUsers = [];
    for(let user of users){
        if(user.age>=18) {
            adultUsers.push(user)
        } else {
            noAdultUsers.push(user)
        }
    }
==============================================================================
/*задача 8
Необходимо создать массив из 15 элементов. В массиве обязательно должны быть одинаковые значения.
Напишите код, который уберет эти дубликаты из созданного массива.*/

let arr = [1,2,3,4,5,5,5,6,7,8,9,9,10,10,11]
let newArr = []
arr.forEach((item) => {
    if(!newArr.includes(item)){
        newArr.push(item)
    }
})
==============================================================================
/*задача 9
Напишите код, который проверит является строка полиндромом
(слово, которое с обеих сторон читается одинаково, например РЕПЕР, ШАЛАШ)*/

==============================================================================
/*задача 10
Написать функцию, которая принимает первым аргументом массив, а вторым любое значение,
функция должна вернуть индекс если такое значение есть в массиве и -1 если его нет.
(indexOf, findIndex не использовать!)*/

==============================================================================
/*задача 11
Написать функцию search, которая принимает первым аргументом массив имен:

[ ‘Ivan’, ‘Petr’, ‘Sidor’, ...]
и любую произвольную строку. Функция должна отфильтровать массив в зависимости от строки
(в независимости от регистра). Например:

search([‘Ivan’, ‘Petr’, ‘Sidor’], 'si') -> ['Sidor']
search([‘Ivan’, ‘Petr’, ‘Sidor’], 'i') -> [‘Ivan’,'Sidor']
search([‘Ivan’, ‘Petr’, ‘Sidor’, 'Petric'], 'eTr') -> [‘Petr’,'Petric']
search([‘Ivan’, ‘Petr’, ‘Sidor’, 'Petric'], 'eTrooo') -> []*/

==============================================================================
/*задача 12
Написать функцию сравнения двух массивов, которая возвращает true или false
в зависимости от того, одинаковые у них элементы или нет. Пример:
checkIsEqaul([1,2,3], [1,2,3]) -> true
checkIsEqaul([1,2,3], [1,2,3,4]) -> false
checkIsEqaul([1,2,3], [1,'2',3]) -> false*/

==============================================================================
